-- ============================================
-- Задача: Определить клиентов с датой регистрации 2кв 2021г и с часовым поясом региона проживания 4+ – 8+. 
-- Источник: Тестовое задание по займам
-- Тема: JOIN, фильтрация по дате, диапазон значений
-- ============================================

SELECT
    c.customer_id,
    c.created,
    r.timezone
FROM customers c
INNER JOIN regions r
    ON c.region_id = r.region_id
WHERE c.created BETWEEN '2021-04-01' AND '2021-06-30 23:59:59'
    AND r.timezone IN ('4+', '5+', '6+', '7+', '8+')